var data = [
  0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0,
  0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0,
  0.0, 0.0, 4.54793488094e-05, 0.000465708531808, 0.00252763305639, 0.00967220153406, 0.0292924443477, 0.074741425957, 0.167056789556, 0.33585296979,
  0.618977047072, 1.06079122008, 1.70924121139, 2.61211008902, 3.8129889746, 5.34750798933, 7.2402826846, 9.50288074133, 12.1329417963, 15.1144239493,
  18.4188261619, 22.0071563739, 25.8323805755, 29.8420913011, 33.9811646945, 38.1942223985, 42.4277682438, 46.6319224029, 50.7617221881, 54.7779961494,
  58.6478455751, 62.3447852877, 65.8486049739, 69.1450148255, 72.2251367657, 75.0848966337, 77.7243648231, 80.1470841572, 82.359415085, 84.369920167,
  86.1888026536, 87.8274079126, 89.2977915753, 90.6123544976, 91.7835418655, 92.8236018735, 93.7443982257, 94.5572700987, 95.2729330414, 95.901414438,
  96.4520175341, 96.9333085457, 97.35312196, 97.7185797608, 98.036120926, 98.311538131, 98.5500191283, 98.7561907611, 98.934163992, 99.0875786965,
]
var ctx = document.getElementById('chart').getContext('2d')
var chart = new Chart(ctx, {
  type: 'bar',
  data: {
    labels: data.map(function(_, i){return i+1}),
    datasets: [{
      label: ' 23マス埋まっている確率',
      backgroundColor: '#2ebaae',
      data: data,
    }],
  },
  options: {
    legend: {
      display: false,
    },
    title: {
      display: true,
      text: '23マス埋まっている確率',
    },
    tooltips: {
      mode: 'x',
      intersect: false,
      displayColors: false,
      callbacks: {
        title: function(tooltipItems) {
          return tooltipItems[0].xLabel + '回ビンゴ回した時の確率'

        },
        label: function(tooltipItem) {
          return tooltipItem.yLabel + '%'
        },
      },
    },
    scales: {
      xAxes: [{
        ticks: {
          autoSkip: true,
          maxTicksLimit: 24,
        },
        scaleLabel: {
          display: true,
          labelString: '回数',
        },
      }],
      yAxes: [{
        scaleLabel: {
          display: true,
          labelString: '確率',
        },
      }],
    },
  },
})
